; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	image0 - mode
	thermograph1 - mode
	infrared2 - mode
	thermograph3 - mode
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star3)
	(supports instrument3 thermograph3)
	(supports instrument3 infrared2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument5 infrared2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph3)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star3)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument8 thermograph3)
	(supports instrument8 image0)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 thermograph3)
	(supports instrument9 infrared2)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 thermograph3)
	(supports instrument11 infrared2)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 GroundStation2)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Star1)
	(pointing satellite2 Phenomenon6)
	(have_image Planet5 image0)
	(have_image Phenomenon6 thermograph3)
	(have_image Planet7 thermograph3)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 thermograph1)
	(have_image Star10 thermograph3)
	(have_image Phenomenon11 image0)
))

)

; plan
1. (switch_on instrument11 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument11)
   goals met: 0 of 10
2. (calibrate satellite3 instrument11 groundstation2)
   added: (calibrated instrument11)
   goals met: 0 of 10
3. (turn_to satellite3 phenomenon8 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon8)
   goals met: 0 of 10
4. (take_image satellite3 phenomenon8 instrument11 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 1 of 10
5. (turn_to satellite3 phenomenon6 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 phenomenon6)
   goals met: 1 of 10
6. (turn_to satellite2 phenomenon6 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon6)
   goals met: 2 of 10
7. (turn_to satellite1 star1 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star1)
   goals met: 3 of 10
8. (turn_to satellite0 groundstation2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation2)
   goals met: 3 of 10
9. (take_image satellite3 phenomenon6 instrument11 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 4 of 10
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 10
11. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 4 of 10
12. (turn_to satellite0 phenomenon11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 10
13. (take_image satellite0 phenomenon11 instrument0 image0)
   added: (have_image phenomenon11 image0)
   goals met: 5 of 10
14. (turn_to satellite0 planet5 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet5)
   goals met: 5 of 10
15. (take_image satellite0 planet5 instrument0 image0)
   added: (have_image planet5 image0)
   goals met: 6 of 10
16. (turn_to satellite0 planet7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet7)
   goals met: 6 of 10
17. (take_image satellite0 planet7 instrument0 thermograph3)
   added: (have_image planet7 thermograph3)
   goals met: 7 of 10
18. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   goals met: 7 of 10
19. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 8 of 10
20. (turn_to satellite0 star3 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star3)
   goals met: 9 of 10
21. (turn_to satellite3 planet9 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 planet9)
   goals met: 9 of 10
22. (take_image satellite3 planet9 instrument11 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 10 of 10
